In [3]:
import pandas as pd
import numpy as np
import os

In [5]:
Shop_Customer_Data = pd.read_csv(r"C:\Users\rolak\Downloads\Customers.csv")

In [7]:
Shop_Customer_Data.shape

(2000, 8)

In [10]:
Shop_Customer_Data.head()

,CustomerID,Gender,Age,Annual Income ($),Spending Score (1-100),Profession,Work Experience,Family Size
0,1,Male,19,15000,39,Healthcare,1,4
1,2,Male,21,35000,81,Engineer,3,3
2,3,Female,20,86000,6,Engineer,1,1
3,4,Female,23,59000,77,Lawyer,0,2
4,5,Female,31,38000,40,Entertainment,2,6

In [14]:
del Shop_Customer_Data["Family Size"]

In [16]:
Shop_Customer_Data.head()

,Gender,Age,Annual Income ($),Spending Score (1-100),Profession,Work Experience
0,Male,19,15000,39,Healthcare,1
1,Male,21,35000,81,Engineer,3
2,Female,20,86000,6,Engineer,1
3,Female,23,59000,77,Lawyer,0
4,Female,31,38000,40,Entertainment,2

In [26]:
new_Gender = pd.Categorical(Shop_Customer_Data["Gender"], ordered = True)
new_Gender = new_Gender.rename_categories(["class1","class2"])
new_Gender.describe()

            counts  freqs
categories
class1        1186  0.593
class2         814  0.407

In [30]:
Shop_Customer_Data['Age'].describe()

count    2000.000000
mean       48.960000
std        28.429747
min         0.000000
25%        25.000000
50%        48.000000
75%        73.000000
max        99.000000
Name: Age, dtype: float64

In [31]:
missing = np.where(Shop_Customer_Data['Age'].isnull() ==True)
missing

(array([], dtype=int64),)

In [33]:
len(missing[0])

0